Reports/НезавершенноеПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>НезавершенноеПроизводство</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/НезавершенноеПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>НезавершенноеПроизводство</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийНезавершенноеПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована списанием партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураЗатратКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродукцияКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеНЗП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппаНЗП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.Партия</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/НезавершенноеПроизводство/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета по метаданным регистра накопления
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	УниверсальныйОтчет.ИмяРегистра = "НезавершенноеПроизводство";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	
	// Описание исходного текста запроса.
	
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	НезавершенноеПроизводство.Подразделение КАК Подразделение,
	|	НезавершенноеПроизводство.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	НезавершенноеПроизводство.СтатьяЗатрат КАК СтатьяЗатрат,
	|	НезавершенноеПроизводство.Регистратор КАК Регистратор,
	|	НезавершенноеПроизводство.НоменклатураЗатрат КАК НоменклатураЗатрат,
	|	НезавершенноеПроизводство.НачОст,
	|	НезавершенноеПроизводство.НачОстНДС,
	|	НезавершенноеПроизводство.Приход,
	|	НезавершенноеПроизводство.ПриходНДС,
	|	НезавершенноеПроизводство.Расход,
	|	НезавершенноеПроизводство.РасходНДС,
	|	НезавершенноеПроизводство.КонОст,
	|	НезавершенноеПроизводство.КонОстНДС,
	|	НезавершенноеПроизводство.НоменклатураЗатратКоличество
	|{ВЫБРАТЬ
	|	Подразделение.*,
	|	НоменклатурнаяГруппа.*,
	|	СтатьяЗатрат.*,
	|	Регистратор.*,
	|	НоменклатураЗатрат.*,
	|   НоменклатураЗатратКоличество,
	|	НачОст,
	|	НачОстНДС,
	|	Приход,
	|	ПриходНДС,
	|	Расход,
	|	РасходНДС,
	|	КонОст,
	|	КонОстНДС}
	|
	|ИЗ 
	|(ВЫБРАТЬ
	|	НезавершенноеПроизводствоНачальныеОстатки.Подразделение КАК Подразделение,
	|	НезавершенноеПроизводствоНачальныеОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	Неопределено КАК СтатьяЗатрат,
	|	Неопределено КАК Регистратор,
	|	Неопределено КАК НоменклатураЗатрат,
	|   0 КАК НоменклатураЗатратКоличество,
	|	СтоимостьОстаток КАК НачОст,
	|	НДСОстаток КАК НачОстНДС,
	|	0 КАК Приход,
	|	0 КАК ПриходНДС,
	|	0 КАК Расход,
	|	0 КАК РасходНДС,
	|	0 КАК КонОст,
	|	0 КАК КонОстНДС
	|	
	|	ИЗ РегистрНакопления.НезавершенноеПроизводство.Остатки(&ДатаНач, {Подразделение.* КАК Подразделение, НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа} ) КАК НезавершенноеПроизводствоНачальныеОстатки
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	НезавершенноеПроизводствоКонечныеОстатки.Подразделение КАК Подразделение,
	|	НезавершенноеПроизводствоКонечныеОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	Неопределено КАК СтатьяЗатрат,
	|	Неопределено КАК Регистратор,
	|	Неопределено КАК НоменклатураЗатрат,
	|   0 КАК НоменклатураЗатратКоличество,
	|	0 КАК НачОст,
	|	0 КАК НачОстНДС,
	|	0 КАК Приход,
	|	0 КАК ПриходНДС,
	|	0 КАК Расход,
	|	0 КАК РасходНДС,
	|	СтоимостьОстаток КАК КонОст,
	|	НДСОстаток КАК КонОстНДС
	|	
	|	ИЗ РегистрНакопления.НезавершенноеПроизводство.Остатки(&ДатаКон, {Подразделение.* КАК Подразделение, НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа}) КАК НезавершенноеПроизводствоКонечныеОстатки
    |
	|ОБЪЕДИНИТЬ ВСЕ
    |
	|ВЫБРАТЬ
    |
	|	НезавершенноеПроизводствоОбороты.Подразделение КАК Подразделение,
	|	НезавершенноеПроизводствоОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	НезавершенноеПроизводствоОбороты.СтатьяЗатрат КАК СтатьяЗатрат,
	|	НезавершенноеПроизводствоОбороты.Регистратор КАК Регистратор,
	|	НезавершенноеПроизводствоОбороты.НоменклатураЗатрат КАК НоменклатураЗатрат,
	|   СУММА(НезавершенноеПроизводствоОбороты.НоменклатураЗатратКоличество) КАК НоменклатураЗатратКоличество,
	|	СУММА(0) КАК НачОст,
	|	СУММА(0) КАК НачОстНДС,
	|	СУММА(ВЫБОР КОГДА НезавершенноеПроизводствоОбороты.ВидДвижения = &ВидДвиженияПриход ТОГДА (НезавершенноеПроизводствоОбороты.Стоимость) ИНАЧЕ 0 КОНЕЦ) КАК Приход,
	|	СУММА(ВЫБОР КОГДА НезавершенноеПроизводствоОбороты.ВидДвижения = &ВидДвиженияПриход ТОГДА (НезавершенноеПроизводствоОбороты.НДС) ИНАЧЕ 0 КОНЕЦ) КАК ПриходНДС,
	|	СУММА(ВЫБОР КОГДА НезавершенноеПроизводствоОбороты.ВидДвижения = &ВидДвиженияРасход ТОГДА (НезавершенноеПроизводствоОбороты.Стоимость) ИНАЧЕ 0 КОНЕЦ) КАК Расход,
	|	СУММА(ВЫБОР КОГДА НезавершенноеПроизводствоОбороты.ВидДвижения = &ВидДвиженияРасход ТОГДА (НезавершенноеПроизводствоОбороты.НДС) ИНАЧЕ 0 КОНЕЦ) КАК РасходНДС,
	|	СУММА(0) КАК КонОст,
	|	СУММА(0) КАК КонОстНДС
	|ИЗ
	|	РегистрНакопления.НезавершенноеПроизводство КАК НезавершенноеПроизводствоОбороты
	|ГДЕ
	|	НезавершенноеПроизводствоОбороты.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	|{ГДЕ
	|	НезавершенноеПроизводствоОбороты.Подразделение.* КАК Подразделение,
	|	НезавершенноеПроизводствоОбороты.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа,
	|	НезавершенноеПроизводствоОбороты.СтатьяЗатрат.* КАК СтатьяЗатрат,
	|	НезавершенноеПроизводствоОбороты.Регистратор.* КАК Регистратор}
	|
	|СГРУППИРОВАТЬ ПО
	|	НезавершенноеПроизводствоОбороты.Подразделение,
	|	НезавершенноеПроизводствоОбороты.НоменклатурнаяГруппа,
	|	НезавершенноеПроизводствоОбороты.СтатьяЗатрат,
	|	НезавершенноеПроизводствоОбороты.НоменклатураЗатрат,
	|	НезавершенноеПроизводствоОбороты.Регистратор
	|) КАК НезавершенноеПроизводство
    |
	|{ГДЕ
	|	НезавершенноеПроизводство.Подразделение.*,
	|	НезавершенноеПроизводство.НоменклатурнаяГруппа.*,
	|	НезавершенноеПроизводство.СтатьяЗатрат.*,
	|	НезавершенноеПроизводство.Регистратор.*,
	|	НезавершенноеПроизводство.НоменклатураЗатрат.*,
	|   НезавершенноеПроизводство.НоменклатураЗатратКоличество,
	|	НезавершенноеПроизводство.НачОст,
	|	НезавершенноеПроизводство.НачОстНДС,
	|	НезавершенноеПроизводство.Приход,
	|	НезавершенноеПроизводство.ПриходНДС,
	|	НезавершенноеПроизводство.Расход,
	|	НезавершенноеПроизводство.РасходНДС,
	|	НезавершенноеПроизводство.КонОст,
	|	НезавершенноеПроизводство.КонОстНДС}
	|
	|{УПОРЯДОЧИТЬ ПО
	|	Подразделение.*,
	|	НоменклатурнаяГруппа.*,
	|	СтатьяЗатрат.*,
	|	НоменклатураЗатрат.*,
	|	Регистратор.*}
	|
	|ИТОГИ
	|	СУММА(НачОст),
	|	СУММА(НачОстНДС),
	|	СУММА(Приход),
	|	СУММА(ПриходНДС),
	|	СУММА(Расход),
	|	СУММА(РасходНДС),
	|	СУММА(КонОст),
	|	СУММА(КонОстНДС),
	|	СУММА(НоменклатураЗатратКоличество)
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Подразделение.*,
	|	НоменклатурнаяГруппа.*,
	|	СтатьяЗатрат.*,
	|	НоменклатураЗатрат.*,
	|	Регистратор.*}";
	
	
	
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Подразделение", НСтр("ru='Подразделение';uk='Підрозділ'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НоменклатурнаяГруппа", НСтр("ru='Номенклатурная группа';uk='Номенклатурна група'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтатьяЗатрат", НСтр("ru='Статья затрат';uk='Стаття витрат'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НоменклатураЗатрат", НСтр("ru='Израсходованые материалы';uk='Витрачені матеріали'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НачОст"	   , НСтр("ru='Нач. остаток';uk='Поч. залишок'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НачОстНДС"   , НСтр("ru='Нач. остаток (НДС)';uk='Поч. залишок (ПДВ)'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Приход"	   , НСтр("ru='Приход';uk='Прибуток'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ПриходНДС"   , НСтр("ru='Приход (НДС)';uk='Прибуток (ПДВ)'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Расход"	   , НСтр("ru='Расход';uk='Витрата'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("РасходНДС"   , НСтр("ru='Расход (НДС)';uk='Витрата (ПДВ)'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КонОстС"	   , НСтр("ru='Кон. остаток';uk='Кін. залишок'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КонОстНДС"   , НСтр("ru='Кон. остаток (НДС)';uk='Кін. залишок (ПДВ)'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НоменклатураЗатратКоличество"   , НСтр("ru='Количество израсходованных материалов';uk='Кількість витрачених матеріалів'"));
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	
	ВалютаУпр = глЗначениеПеременной("ВалютаУправленческогоУчета");
	
	УниверсальныйОтчет.ДобавитьПоказатель("НачОст", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "НачальныйОстаток", НСтр("ru='Начальный остаток (';uk='Початковий залишок ('") + ВалютаУпр + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("НачОстНДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "НачальныйОстаток");
	
	УниверсальныйОтчет.ДобавитьПоказатель("Приход", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "Приход", НСтр("ru='Приход (';uk='Прибуток ('") + ВалютаУпр + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("ПриходНДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "Приход");
	
	УниверсальныйОтчет.ДобавитьПоказатель("НоменклатураЗатратКоличество", НСтр("ru='К-во материалов';uk='К-сть матеріалів'"), Ложь, "ЧЦ=15; ЧДЦ=3", "Приход");
	
	УниверсальныйОтчет.ДобавитьПоказатель("Расход", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "Расход", НСтр("ru='Расход (';uk='Витрата ('") + ВалютаУпр + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("РасходНДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "Расход");
	
	УниверсальныйОтчет.ДобавитьПоказатель("КонОст", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "КонечныйОстаток", НСтр("ru='Конечный остаток (';uk='Кінцевий залишок ('") + ВалютаУпр + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("КонОстНДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "КонечныйОстаток");
	
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Подразделение");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("НоменклатурнаяГруппа");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("СтатьяЗатрат");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("НоменклатурнаяГруппа");
	УниверсальныйОтчет.ДобавитьОтбор("СтатьяЗатрат");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ВидДвиженияПриход",     ВидДвиженияНакопления.Приход);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ВидДвиженияРасход",     ВидДвиженияНакопления.Расход);
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
